module.exports = {
    API_HOST: 'https://tapi.star0ad.com',
    REQUEST_TIMEOUT: 2000000,
    // firstGameEndTime: '2017-09-07T16:59:59+08:00',
    firstGameEndTime: '2017-10-07T16:59:59+08:00',
    lastGameEndTime: '2017-10-30T01:59:59+08:00',
    targetDatesWithZone: [
        // {start: '2017-10-01T16:00:00+08:00', last: '2017-10-02T01:00:00+08:00', type: 'MAX_WIN', vol: "第0期", volLabel: "第0期 (10月1日、10月2日)"},
        // {start: '2017-10-02T16:00:00+08:00', last: '2017-10-03T01:00:00+08:00', type: 'MAX_ODDS', vol: "第0期", volLabel: "第0期 (10月1日、10月2日)"},
        // {start: '2017-10-04T16:00:00+08:00', last: '2017-10-05T01:00:00+08:00', type: 'MAX_WIN', vol: "第0-1期", volLabel: "第0-1期 (10月4日、10月5日)"},
        // {start: '2017-10-05T16:00:00+08:00', last: '2017-10-06T01:00:00+08:00', type: 'MAX_ODDS', vol: "第0-1期", volLabel: "第0-1期 (10月4日、10月5日)"},

        {start: '2017-10-07T16:00:00+08:00', last: '2017-10-08T01:00:00+08:00', type: 'MAX_WIN', vol: "第一期", volLabel: "第一期 (10月7日、10月8日)"},
        {start: '2017-10-08T16:00:00+08:00', last: '2017-10-09T01:00:00+08:00', type: 'MAX_ODDS', vol: "第一期", volLabel: "第一期 (10月7日、10月8日)"},
        {start: '2017-10-14T16:00:00+08:00', last: '2017-10-15T01:00:00+08:00', type: 'MAX_WIN', vol: "第二期", volLabel: "第二期 (10月14日、10月15日)"},
        {start: '2017-10-15T16:00:00+08:00', last: '2017-10-16T01:00:00+08:00', type: 'MAX_ODDS', vol: "第二期", volLabel: "第二期 (10月14日、10月15日)"},
        {start: '2017-10-21T16:00:00+08:00', last: '2017-10-22T01:00:00+08:00', type: 'MAX_WIN', vol: "第三期", volLabel: "第三期 (10月21日、10月22日)"},
        {start: '2017-10-22T16:00:00+08:00', last: '2017-10-23T01:00:00+08:00', type: 'MAX_ODDS', vol: "第三期", volLabel: "第三期 (10月21日、10月22日)"},
        {start: '2017-10-28T16:00:00+08:00', last: '2017-10-29T01:00:00+08:00', type: 'MAX_WIN', vol: "第四期", volLabel: "第四期 (10月28日、10月29日)"},
        {start: '2017-10-29T16:00:00+08:00', last: '2017-10-30T01:00:00+08:00', type: 'MAX_ODDS', vol: "第四期", volLabel: "第四期 (10月28日、10月29日)"}
    ],
    targetDates: [
        // {start: '2017-10-01T16:00:00', last: '2017-10-02T01:00:00', type: 'MAX_WIN', vol: "第0期", volLabel: "第0期 (10月1日、10月2日)"},
        // {start: '2017-10-02T16:00:00', last: '2017-10-03T01:00:00', type: 'MAX_ODDS', vol: "第0期", volLabel: "第0期 (10月1日、10月2日)"},
        // {start: '2017-10-04T16:00:00', last: '2017-10-05T01:00:00', type: 'MAX_WIN', vol: "第0-1期", volLabel: "第0-1期 (10月4日、10月5日)"},
        // {start: '2017-10-05T16:00:00', last: '2017-10-06T01:00:00', type: 'MAX_ODDS', vol: "第0-1期", volLabel: "第0-1期 (10月4日、10月5日)"},

        {start: '2017-10-07T16:00:00', last: '2017-10-08T01:00:00', type: 'MAX_WIN', vol: "第一期", volLabel: "第一期 (10月7日、10月8日)"},
        {start: '2017-10-08T16:00:00', last: '2017-10-09T01:00:00', type: 'MAX_ODDS', vol: "第一期", volLabel: "第一期 (10月7日、10月8日)"},
        {start: '2017-10-14T16:00:00', last: '2017-10-15T01:00:00', type: 'MAX_WIN', vol: "第二期", volLabel: "第二期 (10月14日、10月15日)"},
        {start: '2017-10-15T16:00:00', last: '2017-10-16T01:00:00', type: 'MAX_ODDS', vol: "第二期", volLabel: "第二期 (10月14日、10月15日)"},
        {start: '2017-10-21T16:00:00', last: '2017-10-22T01:00:00', type: 'MAX_WIN', vol: "第三期", volLabel: "第三期 (10月21日、10月22日)"},
        {start: '2017-10-22T16:00:00', last: '2017-10-23T01:00:00', type: 'MAX_ODDS', vol: "第三期", volLabel: "第三期 (10月21日、10月22日)"},
        {start: '2017-10-28T16:00:00', last: '2017-10-29T01:00:00', type: 'MAX_WIN', vol: "第四期", volLabel: "第四期 (10月28日、10月29日)"},
        {start: '2017-10-29T16:00:00', last: '2017-10-30T01:00:00', type: 'MAX_ODDS', vol: "第四期", volLabel: "第四期 (10月28日、10月29日)"}
    ],
    timeList: [
        {val:'16:00:00', label:'16:00-17:00'},
        {val:'17:00:00', label:'17:00-18:00'},
        {val:'18:00:00', label:'18:00-19:00'},
        {val:'19:00:00', label:'19:00-20:00'},
        {val:'20:00:00', label:'20:00-21:00'},
        {val:'21:00:00', label:'21:00-22:00'},
        {val:'22:00:00', label:'22:00-23:00'},
        {val:'23:00:00', label:'23:00-00:00'},
        {val:'00:00:00', label:'(次日凌晨) 00:00-01:00'},
        {val:'01:00:00', label:'(次日凌晨) 01:00-02:00'},
        {val:'All', label:'所有时段'}
    ],
    // for reducer
    testTimeList: [
        {val:'09:00:00', label:'09:00-10:00'},
        {val:'10:00:00', label:'10:00-11:00'},
        {val:'11:00:00', label:'11:00-12:00'},
        {val:'12:00:00', label:'12:00-13:00'},
        {val:'13:00:00', label:'13:00-14:00'},
        {val:'14:00:00', label:'14:00-15:00'},
        {val:'15:00:00', label:'13:00-16:00'},
        {val:'16:00:00', label:'16:00-17:00'},
        {val:'17:00:00', label:'17:00-18:00'},
        {val:'18:00:00', label:'18:00-19:00'},
        {val:'19:00:00', label:'19:00-20:00'},
        {val:'20:00:00', label:'20:00-21:00'},
        {val:'21:00:00', label:'21:00-22:00'},
        {val:'22:00:00', label:'22:00-23:00'},
        {val:'23:00:00', label:'23:00-00:00'},
        {val:'00:00:00', label:'(次日凌晨) 00:00-01:00'},
        {val:'01:00:00', label:'(次日凌晨) 01:00-02:00'},
        {val:'All', label:'所有时段'}
    ]
}
